Итоговая контрольная работа по основному блоку
Урок 1. Контрольная работа
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub

https://github.com/Cosmatik/FinalControlWork.git


2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)


 








3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)

1.	Для начала создаем массив string[ ] array.
2.	Метод PrintArray выводит на экран заданный массив.
3.	Метод ArrLength нужен, чтобы определить размер нового массива (цикл, перебирает все элементы заданного массива string[ ] array, а счетчик count подсчитывает сколько элементов меньше либо равны 3 символам).
4.	Метод NewArray создает новый массив, с размером который получим из метода ArrLength. Метод принимает заданный в начале алгоритма массив string[ ] array, проходится циклом по этому массиву и элементами с длинной меньше либо равной 3 символам заполняет новый массив string[ ] result.
5.	С помощью повторного обращения к методу PrintArray новый массив string[ ] result выводится на экран.

4. Написать программу, решающую поставленную задачу


Console.Clear();
string[] array = { "Hello", "2", "world", "!!!" };
PrintArray(array);
Console.Write(" -> ");

int sizeNewArray = ArrLength(array);

string[] result = NewArray(array);

PrintArray(result);

int ArrLength(string[] array)
{
  int count = 0;
  for (int i = 0; i < array.Length; i++)
  {
    if (array[i].Length <= 3) count++;
  }
  return count;
}

string[] NewArray(string[] array)
{
  int index = 0;
  string[] result = new string[sizeNewArray];

  for (int i = 0; i < array.Length; i++)
  {
    if (array[i].Length <= 3)
    {
      result[index] = array[i];
      index++;
    }
  }
  return result;
}
// void PrintArray(string[] arr)
// {
//   Console.WriteLine("[{0}]", string.Join(", ", arr));
// }
void PrintArray(string[] arr)
{
  Console.Write("[");
  for (int i = 0; i < arr.Length; i++)
  {
    if (i < arr.Length - 1) Console.Write($"{arr[i]}, ");
    else Console.Write($"{arr[i]}");
  }
  Console.Write("]");
}

5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []


--

